SQL is standard language for managing and manipulating relational databases.SQLite is self-conatined,serverless,and zero-configuration database engine that is widely used for embedded tables and performing various SQL operations

In [1]:
import sqlite3

In [2]:
##connect to an SQLlite database 
connection = sqlite3.connect('example.db')
connection

In [3]:
cursor = connection.cursor()

In [4]:
##create a table 
cursor.execute('''
CREATE TABLE IF NOT EXISTS employees (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    age INTEGER,
    department TEXT
)''')
#commit the changes 
connection.commit()

In [5]:
cursor.execute('''
    Select * from employees
''')

In [6]:
#insert the data in sqlite table 
cursor.execute("INSERT INTO employees (name, age, department) VALUES ('Krish', 32, 'Data Scientist')")
cursor.execute("INSERT INTO employees (name, age, department) VALUES ('Bob', 25, 'Engineering')")
cursor.execute("INSERT INTO employees (name, age, department) VALUES ('Charlie', 35, 'Finance')")
connection.commit()

In [9]:
cursor.execute('SELECT * FROM employees')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Krish', 32, 'Data Scientist')
(2, 'Bob', 25, 'Engineering')
(3, 'Charlie', 35, 'Finance')

In [10]:
##update the data in table 
cursor.execute("UPDATE employees SET age = 34 WHERE name = 'Krish'")
connection.commit()

In [11]:
cursor.execute('SELECT * FROM employees')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Krish', 34, 'Data Scientist')
(2, 'Bob', 25, 'Engineering')
(3, 'Charlie', 35, 'Finance')

In [12]:
cursor.execute("DELETE FROM employees WHERE name = 'Bob'")
connection.commit()

In [13]:
cursor.execute('SELECT * FROM employees')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Krish', 34, 'Data Scientist')
(3, 'Charlie', 35, 'Finance')

In [17]:
#working with the sales data 
connection = sqlite3.connect('sales_data.db')
cursor = connection.cursor()
#create a table for sales data 
cursor.execute('''
CREATE TABLE IF NOT EXISTS sales(
               id INTEGER PRIMARY KEY,
               date TEXT NOT NULL,
               product TEXT NOT NULL,
               sales INTEGER,
               region TEXT
               )
''')

sales_data = [
    ('2023-01-01', 'ProductA', 100, 'North'),
    ('2023-01-02', 'ProductB', 150, 'South'),
    ('2023-01-03', 'ProductC', 200, 'East'),
    ('2023-01-04', 'ProductD', 250, 'West')
]
cursor.executemany(
    'INSERT INTO sales (date, product, sales, region) VALUES (?, ?, ?, ?)',
    sales_data
)
connection.commit()

In [18]:
cursor.execute('SELECT * FROM sales')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, '2023-01-01', 'ProductA', 100, 'North')
(2, '2023-01-02', 'ProductB', 150, 'South')
(3, '2023-01-03', 'ProductC', 200, 'East')
(4, '2023-01-04', 'ProductD', 250, 'West')

In [20]:
connection.close()

In [21]:
cursor.execute('SELECT * FROM sales')
rows = cursor.fetchall()
for row in rows:
    print(row)

ProgrammingError: Cannot operate on a closed database.